####################################################################
#遍历循环
#for<循环变量>in<遍历结构>：
#遍历结构可以是字符串，列表,元组，字典等等

#1--计数循环 for i in rang(N)或者(rang(m:n:k))

#2--字符串遍历循环
   #for c in s: 遍历字符串每一个字符

s = "python123"
str1 = []
for c in s:
     print(c,end=",")

####################################################################
#3--列表遍历(或者列表里面的元素)

ls = ['a','b','c','d','e','f','g']
print("\n")
for  item in ls:
    print(item,end="\t")

ls1 = [123,"abc",[9,8,7]]
print("\n")
for item1 in ls1:
    print(item1)

####################################################################

#4--文件遍历
#for line in fi:
#fi是文件标识符，for遍历其中每一行

#5--元组遍历

tuple1 = {'qwerty','asdf','fghj','jkl','zxcv','bnm','uiop'}
for tu in tuple1:
    print(tu)

#6--字典遍历

ditc = {1:"a",2:"b",3:"c"}
for mychar in ditc.values():
    print(mychar)

####################################################################
#无限循环
i_run = 0
while(i_run<10):
    i_run +=1
    print(i_run)

######## ############################################################
#循环与else
#else是完成的奖励，除非被break(与异常的else类似)
for i in "abcde":
    if i=='c':
        #break
        continue
    print(i,end="\t")
else:
    print("\nfor_done")

print("###################################################")
i1 = 0
while(i1<5):
    print(i1)
    i1+=1
else:
    print("while_done")


####################################################################
####################################################################